NordicSemiconductor/nrfx/mdk/nrf54h20_enga_radiocore_peripherals.h
#define RTC_CC_NUM_MIN 0                             /*!< (unspecified)                                                        */
#define RTC_CC_NUM_MAX 7                             /*!< (unspecified)                                                        */
#define RTC_CC_NUM_SIZE 8                            /*!< (unspecified)                                                        */
#define RTC_BIT_WIDTH_MIN 0                          /*!< (unspecified)                                                        */
#define RTC_BIT_WIDTH_MAX 23                         /*!< (unspecified)                                                        */
#define RTC_BIT_WIDTH_SIZE 24                        /*!< (unspecified)                                                        */
#define RTC_LFCLK_ENABLE 0                           /*!< (unspecified)                                                        */

#define RTC130_CC_NUM_MIN 0                          /*!< (unspecified)                                                        */
#define RTC130_CC_NUM_MAX 3                          /*!< (unspecified)                                                        */
#define RTC130_CC_NUM_SIZE 4                         /*!< (unspecified)                                                        */
#define RTC130_BIT_WIDTH_MIN 0                       /*!< (unspecified)                                                        */
#define RTC130_BIT_WIDTH_MAX 23                      /*!< (unspecified)                                                        */
#define RTC130_BIT_WIDTH_SIZE 24                     /*!< (unspecified)                                                        */
#define RTC130_LFCLK_ENABLE 0                        /*!< (unspecified)                                                        */

#define RTC131_CC_NUM_MIN 0                          /*!< (unspecified)                                                        */
#define RTC131_CC_NUM_MAX 3                          /*!< (unspecified)                                                        */
#define RTC131_CC_NUM_SIZE 4                         /*!< (unspecified)                                                        */
#define RTC131_BIT_WIDTH_MIN 0                       /*!< (unspecified)                                                        */
#define RTC131_BIT_WIDTH_MAX 23                      /*!< (unspecified)                                                        */
#define RTC131_BIT_WIDTH_SIZE 24                     /*!< (unspecified)                                                        */
#define RTC131_LFCLK_ENABLE 0                        /*!< (unspecified)                                                        */

/*2.4 GHz radio*/
#define RADIO_PRESENT 1
#define RADIO_COUNT 1

#define RADIO_ADPLLCOMPANION_INCLUDE_DMA 0           /*!< (unspecified)                                                        */
#define RADIO_PERPOWER 0                             /*!< (unspecified)                                                        */

/*VPR peripheral registers*/
#define VPR_PRESENT 1
#define VPR_COUNT 3

#define VPR_INIT_PC_RESET_VALUE 0x00000000           /*!< Boot vector (INIT_PC_RESET_VALUE): 0x00000000                        */
#define VPR_VPR_START_RESET_VALUE 0                  /*!< Self-booting (VPR_START_RESET_VALUE): 0                              */
#define VPR_RAM_BASE_ADDR 0x23010000                 /*!< (unspecified)                                                        */
#define VPR_RAM_SZ 15                                /*!< (unspecified)                                                        */
#define VPR_RETAINED 1                               /*!< (unspecified)                                                        */
#define VPR_VPRSAVEDCTX 0                            /*!< (unspecified)                                                        */
#define VPR_VPRSAVEADDR 0x00000000                   /*!< (unspecified)                                                        */
#define VPR_VPRREMAPADDRVTOB 0x00000000              /*!< (unspecified)                                                        */
#define VPR_VEVIF_NTASKS_MIN 0                       /*!< VEVIF tasks: 0..15                                                   */
#define VPR_VEVIF_NTASKS_MAX 15                      /*!< VEVIF tasks: 0..15                                                   */
#define VPR_VEVIF_NTASKS_SIZE 16                     /*!< VEVIF tasks: 0..15                                                   */
#define VPR_VEVIF_TASKS_MASK 0x0000FF00              /*!< Mask of supported VEVIF tasks: 0x0000FF00                            */
#define VPR_VEVIF_NDPPI_MIN 8                        /*!< VEVIF DPPI channels: 8..10                                           */
#define VPR_VEVIF_NDPPI_MAX 10                       /*!< VEVIF DPPI channels: 8..10                                           */
#define VPR_VEVIF_NDPPI_SIZE 11                      /*!< VEVIF DPPI channels: 8..10                                           */
#define VPR_VEVIF_NEVENTS_MIN 12                     /*!< VEVIF events: 12..15                                                 */
#define VPR_VEVIF_NEVENTS_MAX 15                     /*!< VEVIF events: 12..15                                                 */
#define VPR_VEVIF_NEVENTS_SIZE 16                    /*!< VEVIF events: 12..15                                                 */
#define VPR_DEBUGGER_OFFSET 1024                     /*!< Debugger interface register offset: 0x53034400                       */

#define VPR121_INIT_PC_RESET_VALUE 0x00000000        /*!< Boot vector (INIT_PC_RESET_VALUE): 0x00000000                        */
#define VPR121_VPR_START_RESET_VALUE 0               /*!< Self-booting (VPR_START_RESET_VALUE): 0                              */
#define VPR121_RAM_BASE_ADDR 0x2F890000              /*!< (unspecified)                                                        */
#define VPR121_RAM_SZ 15                             /*!< (unspecified)                                                        */
#define VPR121_VPRSAVEDCTX_REGNAME NRF_MEMCONF120->POWER[0].RET /*!< (unspecified)                                             */
#define VPR121_VPRSAVEDCTX_REGBIT 23                 /*!< (unspecified)                                                        */
#define VPR121_RETAINED 0                            /*!< (unspecified)                                                        */
#define VPR121_VPRSAVEDCTX 1                         /*!< (unspecified)                                                        */
#define VPR121_VPRSAVEADDR 0x2F800000                /*!< (unspecified)                                                        */
#define VPR121_VPRREMAPADDRVTOB 0x00000000           /*!< (unspecified)                                                        */
#define VPR121_VEVIF_NTASKS_MIN 0                    /*!< VEVIF tasks: 0..31                                                   */
#define VPR121_VEVIF_NTASKS_MAX 31                   /*!< VEVIF tasks: 0..31                                                   */
#define VPR121_VEVIF_NTASKS_SIZE 32                  /*!< VEVIF tasks: 0..31                                                   */
#define VPR121_VEVIF_TASKS_MASK 0xFFFF0000           /*!< Mask of supported VEVIF tasks: 0xFFFF0000                            */
#define VPR121_VEVIF_NDPPI_MIN 24                    /*!< VEVIF DPPI channels: 24..27                                          */
#define VPR121_VEVIF_NDPPI_MAX 27                    /*!< VEVIF DPPI channels: 24..27                                          */
#define VPR121_VEVIF_NDPPI_SIZE 28                   /*!< VEVIF DPPI channels: 24..27                                          */
#define VPR121_VEVIF_NEVENTS_MIN 28                  /*!< VEVIF events: 28..31                                                 */
#define VPR121_VEVIF_NEVENTS_MAX 31                  /*!< VEVIF events: 28..31                                                 */
#define VPR121_VEVIF_NEVENTS_SIZE 32                 /*!< VEVIF events: 28..31                                                 */
#define VPR121_DEBUGGER_OFFSET 1024                  /*!< Debugger interface register offset: 0x5F8D4400                       */

#define VPR130_INIT_PC_RESET_VALUE 0x00000000        /*!< Boot vector (INIT_PC_RESET_VALUE): 0x00000000                        */
#define VPR130_VPR_START_RESET_VALUE 0               /*!< Self-booting (VPR_START_RESET_VALUE): 0                              */
#define VPR130_RAM_BASE_ADDR 0x2FC00000              /*!< (unspecified)                                                        */
#define VPR130_RAM_SZ 15                             /*!< (unspecified)                                                        */
#define VPR130_VPRSAVEDCTX_REGNAME NRF_MEMCONF130->POWER[0].RET /*!< (unspecified)                                             */
#define VPR130_VPRSAVEDCTX_REGBIT 5                  /*!< (unspecified)                                                        */
#define VPR130_RETAINED 0                            /*!< (unspecified)                                                        */
#define VPR130_VPRSAVEDCTX 1                         /*!< (unspecified)                                                        */
#define VPR130_VPRSAVEADDR 0x2F800000                /*!< (unspecified)                                                        */
#define VPR130_VPRREMAPADDRVTOB 0x00000000           /*!< (unspecified)                                                        */
#define VPR130_VEVIF_NTASKS_MIN 0                    /*!< VEVIF tasks: 0..15                                                   */
#define VPR130_VEVIF_NTASKS_MAX 15                   /*!< VEVIF tasks: 0..15                                                   */
#define VPR130_VEVIF_NTASKS_SIZE 16                  /*!< VEVIF tasks: 0..15                                                   */
#define VPR130_VEVIF_TASKS_MASK 0xFFFFFFF0           /*!< Mask of supported VEVIF tasks: 0xFFFFFFF0                            */
#define VPR130_VEVIF_NDPPI_MIN 8                     /*!< VEVIF DPPI channels: 8..11                                           */
#define VPR130_VEVIF_NDPPI_MAX 11                    /*!< VEVIF DPPI channels: 8..11                                           */
#define VPR130_VEVIF_NDPPI_SIZE 12                   /*!< VEVIF DPPI channels: 8..11                                           */
#define VPR130_VEVIF_NEVENTS_MIN 12                  /*!< VEVIF events: 12..15                                                 */
#define VPR130_VEVIF_NEVENTS_MAX 15                  /*!< VEVIF events: 12..15                                                 */
#define VPR130_VEVIF_NEVENTS_SIZE 16                 /*!< VEVIF events: 12..15                                                 */
#define VPR130_DEBUGGER_OFFSET 1024                  /*!< Debugger interface register offset: 0x5F908400                       */

/*IPCT APB registers*/
#define IPCT_PRESENT 1
#define IPCT_COUNT 3

/*BELLBOARD APB registers*/
#define BELLBOARD_PRESENT 1
#define BELLBOARD_COUNT 1

/*Factory Information Configuration Registers*/
#define FICR_PRESENT 1
#define FICR_COUNT 1

